# Pandas 
Pandas is an open source, BSD-licensed library providing high-performance, easy-to-use data structures and data analysis tools for the Python programming language. It is a fast, powerful, flexible and easy to use data analysis and manipulation tool, built on top of the Python programming language.

Agenda

- What is Data Frames?
- What is Data Series?
- Different operation in Pandas

In [1]:
# first import pandas and numpy
import pandas as pd 
import numpy as np

In [9]:
#playing with dataframe #Creating a dataframe
df=pd.DataFrame(np.arange(0,20).reshape(5,4),index=["Row1","Row2","Row3","Row4","Row5"],columns=["column1","column2","column3","column4"])

In [10]:
#show-dataset
df

      column1  column2  column3  column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11
Row4       12       13       14       15
Row5       16       17       18       19

In [13]:
#Accessing the elements
# 1. .loc 2. .iloc
df.loc["Row1"]

column1    0
column2    1
column3    2
column4    3
Name: Row1, dtype: int32

In [14]:
#lets check type of this value
type(df.loc["Row1"])

pandas.core.series.Series

In [15]:
#iloc
df.iloc[:,:]

      column1  column2  column3  column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11
Row4       12       13       14       15
Row5       16       17       18       19

In [16]:
df.iloc[0:3,0:2]

      column1  column2
Row1        0        1
Row2        4        5
Row3        8        9

In [37]:
#printing first row and third column value like this way
df.iloc[0,2]

2

In [41]:
#If you do so it will print like a series now let's see below
df.iloc[:,0]

Row1     0
Row2     4
Row3     8
Row4    12
Row5    16
Name: column1, dtype: int32

In [43]:
#Now it is printing like a dataframe lets check the type of it
df.iloc[:,0:1]

      column1
Row1        0
Row2        4
Row3        8
Row4       12
Row5       16

In [45]:
#type #See it's a dataframe
type(df.iloc[:,0:1])

pandas.core.frame.DataFrame

In [36]:
#only taking row indexes last number is excluded
df.iloc[0:3]

      column1  column2  column3  column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11

In [46]:
#convert Dataframes into array
df.iloc[:,:].values

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [12, 13, 14, 15],
       [16, 17, 18, 19]])

In [47]:
#Check thr shape of it
df.iloc[:,:].values.shape

(5, 4)

In [49]:
#Check null for entire dataframe
df.isnull().sum()

column1    0
column2    0
column3    0
column4    0
dtype: int64

In [52]:
#Check the Unique categories in a column
df["column1"].value_counts()

12    1
4     1
16    1
8     1
0     1
Name: column1, dtype: int64

In [53]:
#Check Unique values 
df["column1"].unique()

array([ 0,  4,  8, 12, 16], dtype=int64)

In [56]:
#print multiple columns
df[['column1','column2']]

      column1  column2
Row1        0        1
Row2        4        5
Row3        8        9
Row4       12       13
Row5       16       17

## Here we read a Mercedes-benz dataset
To download this dataset link is given, [click](https://www.kaggle.com/c/mercedes-benz-greener-manufacturing/data?select=train.csv.zip) here to download

In [66]:
#To read the dataset we use read_csv
df2=pd.read_csv('mercedesbenz.csv')

In [67]:
#To load it
df2.head()

,ID,y,X0,X1,X2,X3,X4,X5,X6,X8,...,X375,X376,X377,X378,X379,X380,X382,X383,X384,X385
0,0,130.81,k,v,at,a,d,u,j,o,...,0,0,1,0,0,0,0,0,0,0
1,6,88.53,k,t,av,e,d,y,l,o,...,1,0,0,0,0,0,0,0,0,0
2,7,76.26,az,w,n,c,d,x,j,x,...,0,0,0,0,0,0,1,0,0,0
3,9,80.62,az,t,n,f,d,x,l,e,...,0,0,0,0,0,0,0,0,0,0
4,13,78.02,az,v,n,f,d,h,d,n,...,0,0,0,0,0,0,0,0,0,0

In [69]:
#to see information of this dataset we use
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4209 entries, 0 to 4208
Columns: 378 entries, ID to X385
dtypes: float64(1), int64(369), object(8)
memory usage: 12.1+ MB

In [71]:
df2.describe()

,ID,y,X10,X11,X12,X13,X14,X15,X16,X17,...,X375,X376,X377,X378,X379,X380,X382,X383,X384,X385
count,4209.000000,4209.000000,4209.000000,4209.0,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,...,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000
mean,4205.960798,100.669318,0.013305,0.0,0.075077,0.057971,0.428130,0.000475,0.002613,0.007603,...,0.318841,0.057258,0.314802,0.020670,0.009503,0.008078,0.007603,0.001663,0.000475,0.001426
std,2437.608688,12.679381,0.114590,0.0,0.263547,0.233716,0.494867,0.021796,0.051061,0.086872,...,0.466082,0.232363,0.464492,0.142294,0.097033,0.089524,0.086872,0.040752,0.021796,0.037734
min,0.000000,72.110000,0.000000,0.0,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,2095.000000,90.820000,0.000000,0.0,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
50%,4220.000000,99.150000,0.000000,0.0,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
75%,6314.000000,109.010000,0.000000,0.0,0.000000,0.000000,1.000000,0.000000,0.000000,0.000000,...,1.000000,0.000000,1.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
max,8417.000000,265.320000,1.000000,0.0,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,...,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000

In [76]:
#checking null values
df2.isnull().sum()

ID      0
y       0
X0      0
X1      0
X2      0
       ..
X380    0
X382    0
X383    0
X384    0
X385    0
Length: 378, dtype: int64

In [84]:
#We are converting this to dictonary
dic = dict(df2.isnull().sum())
print(dic, end="")

{'ID': 0, 'y': 0, 'X0': 0, 'X1': 0, 'X2': 0, 'X3': 0, 'X4': 0, 'X5': 0, 'X6': 0, 'X8': 0, 'X10': 0, 'X11': 0, 'X12': 0, 'X13': 0, 'X14': 0, 'X15': 0, 'X16': 0, 'X17': 0, 'X18': 0, 'X19': 0, 'X20': 0, 'X21': 0, 'X22': 0, 'X23': 0, 'X24': 0, 'X26': 0, 'X27': 0, 'X28': 0, 'X29': 0, 'X30': 0, 'X31': 0, 'X32': 0, 'X33': 0, 'X34': 0, 'X35': 0, 'X36': 0, 'X37': 0, 'X38': 0, 'X39': 0, 'X40': 0, 'X41': 0, 'X42': 0, 'X43': 0, 'X44': 0, 'X45': 0, 'X46': 0, 'X47': 0, 'X48': 0, 'X49': 0, 'X50': 0, 'X51': 0, 'X52': 0, 'X53': 0, 'X54': 0, 'X55': 0, 'X56': 0, 'X57': 0, 'X58': 0, 'X59': 0, 'X60': 0, 'X61': 0, 'X62': 0, 'X63': 0, 'X64': 0, 'X65': 0, 'X66': 0, 'X67': 0, 'X68': 0, 'X69': 0, 'X70': 0, 'X71': 0, 'X73': 0, 'X74': 0, 'X75': 0, 'X76': 0, 'X77': 0, 'X78': 0, 'X79': 0, 'X80': 0, 'X81': 0, 'X82': 0, 'X83': 0, 'X84': 0, 'X85': 0, 'X86': 0, 'X87': 0, 'X88': 0, 'X89': 0, 'X90': 0, 'X91': 0, 'X92': 0, 'X93': 0, 'X94': 0, 'X95': 0, 'X96': 0, 'X97': 0, 'X98': 0, 'X99': 0, 'X100': 0, 'X101': 0, 'X102': 0, 'X103': 0, 'X104': 0, 'X105': 0, 'X106': 0, 'X107': 0, 'X108': 0, 'X109': 0, 'X110': 0, 'X111': 0, 'X112': 0, 'X113': 0, 'X114': 0, 'X115': 0, 'X116': 0, 'X117': 0, 'X118': 0, 'X119': 0, 'X120': 0, 'X122': 0, 'X123': 0, 'X124': 0, 'X125': 0, 'X126': 0, 'X127': 0, 'X128': 0, 'X129': 0, 'X130': 0, 'X131': 0, 'X132': 0, 'X133': 0, 'X134': 0, 'X135': 0, 'X136': 0, 'X137': 0, 'X138': 0, 'X139': 0, 'X140': 0, 'X141': 0, 'X142': 0, 'X143': 0, 'X144': 0, 'X145': 0, 'X146': 0, 'X147': 0, 'X148': 0, 'X150': 0, 'X151': 0, 'X152': 0, 'X153': 0, 'X154': 0, 'X155': 0, 'X156': 0, 'X157': 0, 'X158': 0, 'X159': 0, 'X160': 0, 'X161': 0, 'X162': 0, 'X163': 0, 'X164': 0, 'X165': 0, 'X166': 0, 'X167': 0, 'X168': 0, 'X169': 0, 'X170': 0, 'X171': 0, 'X172': 0, 'X173': 0, 'X174': 0, 'X175': 0, 'X176': 0, 'X177': 0, 'X178': 0, 'X179': 0, 'X180': 0, 'X181': 0, 'X182': 0, 'X183': 0, 'X184': 0, 'X185': 0, 'X186': 0, 'X187': 0, 'X189': 0, 'X190': 0, 'X191': 0, 'X192': 0, 'X194': 0, 'X195': 0, 'X196': 0, 'X197': 0, 'X198': 0, 'X199': 0, 'X200': 0, 'X201': 0, 'X202': 0, 'X203': 0, 'X204': 0, 'X205': 0, 'X206': 0, 'X207': 0, 'X208': 0, 'X209': 0, 'X210': 0, 'X211': 0, 'X212': 0, 'X213': 0, 'X214': 0, 'X215': 0, 'X216': 0, 'X217': 0, 'X218': 0, 'X219': 0, 'X220': 0, 'X221': 0, 'X222': 0, 'X223': 0, 'X224': 0, 'X225': 0, 'X226': 0, 'X227': 0, 'X228': 0, 'X229': 0, 'X230': 0, 'X231': 0, 'X232': 0, 'X233': 0, 'X234': 0, 'X235': 0, 'X236': 0, 'X237': 0, 'X238': 0, 'X239': 0, 'X240': 0, 'X241': 0, 'X242': 0, 'X243': 0, 'X244': 0, 'X245': 0, 'X246': 0, 'X247': 0, 'X248': 0, 'X249': 0, 'X250': 0, 'X251': 0, 'X252': 0, 'X253': 0, 'X254': 0, 'X255': 0, 'X256': 0, 'X257': 0, 'X258': 0, 'X259': 0, 'X260': 0, 'X261': 0, 'X262': 0, 'X263': 0, 'X264': 0, 'X265': 0, 'X266': 0, 'X267': 0, 'X268': 0, 'X269': 0, 'X270': 0, 'X271': 0, 'X272': 0, 'X273': 0, 'X274': 0, 'X275': 0, 'X276': 0, 'X277': 0, 'X278': 0, 'X279': 0, 'X280': 0, 'X281': 0, 'X282': 0, 'X283': 0, 'X284': 0, 'X285': 0, 'X286': 0, 'X287': 0, 'X288': 0, 'X289': 0, 'X290': 0, 'X291': 0, 'X292': 0, 'X293': 0, 'X294': 0, 'X295': 0, 'X296': 0, 'X297': 0, 'X298': 0, 'X299': 0, 'X300': 0, 'X301': 0, 'X302': 0, 'X304': 0, 'X305': 0, 'X306': 0, 'X307': 0, 'X308': 0, 'X309': 0, 'X310': 0, 'X311': 0, 'X312': 0, 'X313': 0, 'X314': 0, 'X315': 0, 'X316': 0, 'X317': 0, 'X318': 0, 'X319': 0, 'X320': 0, 'X321': 0, 'X322': 0, 'X323': 0, 'X324': 0, 'X325': 0, 'X326': 0, 'X327': 0, 'X328': 0, 'X329': 0, 'X330': 0, 'X331': 0, 'X332': 0, 'X333': 0, 'X334': 0, 'X335': 0, 'X336': 0, 'X337': 0, 'X338': 0, 'X339': 0, 'X340': 0, 'X341': 0, 'X342': 0, 'X343': 0, 'X344': 0, 'X345': 0, 'X346': 0, 'X347': 0, 'X348': 0, 'X349': 0, 'X350': 0, 'X351': 0, 'X352': 0, 'X353': 0, 'X354': 0, 'X355': 0, 'X356': 0, 'X357': 0, 'X358': 0, 'X359': 0, 'X360': 0, 'X361': 0, 'X362': 0, 'X363': 0, 'X364': 0, 'X365': 0, 'X366': 0, 'X367': 0, 'X368': 0, 'X369': 0, 'X370': 0, 'X371': 0, 'X372': 0, 'X373': 0, 'X374': 0, 'X375': 0, 'X376': 0, 'X377': 0, 'X378': 0, 'X379': 0, 'X380': 0, 'X382': 0, 'X383': 0, 'X384': 0, 'X385': 0}

In [90]:
#Get the unique category counts
df2['X0'].value_counts()

z     360
ak    349
y     324
ay    313
t     306
x     300
o     269
f     227
n     195
w     182
j     181
az    175
aj    151
s     106
ap    103
h      75
d      73
al     67
v      36
af     35
m      34
ai     34
e      32
ba     27
at     25
a      21
ax     19
am     18
i      18
aq     18
u      17
l      16
aw     16
ad     14
k      11
b      11
au     11
as     10
r      10
bc      6
ao      4
c       3
q       2
aa      2
ac      1
g       1
ab      1
Name: X0, dtype: int64

In [92]:
#Cheking the lenght of unique category values
df2['X0'].value_counts().count()

47

In [87]:
#Checking the records that is grater than 100
df2[df2['y']>100]

,ID,y,X0,X1,X2,X3,X4,X5,X6,X8,...,X375,X376,X377,X378,X379,X380,X382,X383,X384,X385
0,0,130.81,k,v,at,a,d,u,j,o,...,0,0,1,0,0,0,0,0,0,0
6,24,128.76,al,r,e,f,d,f,h,s,...,0,0,0,0,0,0,0,0,0,0
8,27,108.67,w,s,as,e,d,f,i,h,...,1,0,0,0,0,0,0,0,0,0
9,30,126.99,j,b,aq,c,d,f,a,e,...,0,0,1,0,0,0,0,0,0,0
10,31,102.09,h,r,r,f,d,f,h,p,...,0,0,0,0,0,0,0,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4202,8402,123.34,ap,l,s,c,d,aa,d,r,...,0,0,0,0,0,0,0,0,0,0
4204,8405,107.39,ak,s,as,c,d,aa,d,q,...,1,0,0,0,0,0,0,0,0,0
4205,8406,108.77,j,o,t,d,d,aa,h,h,...,0,1,0,0,0,0,0,0,0,0
4206,8412,109.22,ak,v,r,a,d,aa,g,e,...,0,0,1,0,0,0,0,0,0,0
4208,8417,110.85,z,r,ae,c,d,aa,g,w,...,1,0,0,0,0,0,0,0,0,0

##### **Convert a DataFrame into CSV file and then read it Again**

In [93]:
#convert dataframe into csv
df.to_csv('Test1.csv')

In [100]:
#Changed the seperator from "Comma" to "semicolon" then read the file
test_df = pd.read_csv('Test1.csv', sep=';', index_col=0)

In [102]:
#printing the data
test_df

      column1  column2  column3  column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11
Row4       12       13       14       15
Row5       16       17       18       19

##### **String to CSV**

In [103]:
from io import StringIO, BytesIO

In [104]:
#Inside the CSV we already seen that data is in this format
data = ('col1,col2,col3\n'
            'x,y,1\n'
            'a,b,2\n'
            'c,d,3')

In [105]:
#But first see what is the type of this data
type(data)

str

In [107]:
#StringIO func will create the in-memory buffer of the data.
#Then with the help of read_csv() we reading it.
pd.read_csv(StringIO(data))

  col1 col2  col3
0    x    y     1
1    a    b     2
2    c    d     3

In [108]:
## Read from specific columns
df_csvio = pd.read_csv(StringIO(data), usecols = lambda x : x.upper() in ['COL1', 'COL3'])
df_csvio

  col1  col3
0    x     1
1    a     2
2    c     3

In [112]:
## Specifying columns data types
data2 = ('a,b,c,d\n'
            '1,2,3,4\n'
            '5,6,7,8\n'
            '9,10,11,12')

In [113]:
print(data2)

a,b,c,d
1,2,3,4
5,6,7,8
9,10,11,12

In [115]:
#Reading the data from string and making columns data types as object
df_csviobj = pd.read_csv(StringIO(data2), dtype=object)
df_csviobj

   a   b   c   d
0  1   2   3   4
1  5   6   7   8
2  9  10  11  12

In [117]:
#printing the column a
df_csviobj['a']

0    1
1    5
2    9
Name: a, dtype: object

In [120]:
#now if i add this with index what wil happen it will give us string value
df_csviobj['a'][1]

'5'

In [121]:
##Reading the data from string and making columns data types as int
df_csvioint = pd.read_csv(StringIO(data2), dtype=int)
df_csvioint

   a   b   c   d
0  1   2   3   4
1  5   6   7   8
2  9  10  11  12

In [124]:
#printing the column 'c' it is a int type
df_csvioint['c']

0     3
1     7
2    11
Name: c, dtype: int32

In [125]:
#printing int value
df_csvioint['a'][1]

5

In [127]:
##Reading the data from string and making columns int, float, and int64 type
df_mixtype = pd.read_csv(StringIO(data2), dtype={'c':int,'b':float,'a':'int64'})
df_mixtype

   a     b   c   d
0  1   2.0   3   4
1  5   6.0   7   8
2  9  10.0  11  12

In [129]:
#let's check type of this
type(df_mixtype['a'][1])

numpy.int64

In [131]:
#check the datatype of dataframe
df_mixtype.dtypes

a      int64
b    float64
c      int32
d      int64
dtype: object

In [132]:
#If we have this kind of data
data3 = ('index,a,b,c\n'
           '4,apple,bat,5.7\n'
            '8,orange,cow,10')

In [136]:
#reading the data
pd.read_csv(StringIO(data3),index_col=0)

            a    b     c
index
4       apple  bat   5.7
8      orange  cow  10.0

In [137]:
#Now if you have this kind of data
data4 = ('a,b,c\n'
           '4,apple,bat,\n'
            '8,orange,cow,')

In [140]:
#reading the data, you can see this sort of things happening
pd.read_csv(StringIO(data4))

        a    b   c
4   apple  bat NaN
8  orange  cow NaN

In [142]:
#Now to fix this use index_col = False
pd.read_csv(StringIO(data4),index_col=False)

   a       b    c
0  4   apple  bat
1  8  orange  cow

In [144]:
## Combining usecols and index_col
data5 = ('a,b,c\n'
           '4,apple,bat,\n'
            '8,orange,cow,')

In [145]:
#Reading the data and combining usecols and index_col
pd.read_csv(StringIO(data5), usecols=['b', 'c'],index_col=False)

        b    c
0   apple  bat
1  orange  cow

In [147]:
# Quoting and Escape Characters. Very useful in NLP
data6 = 'a,b\n"hello, \\"Bob\\", nice to see you",5'

In [148]:
pd.read_csv(StringIO(data6),escapechar='\\')

                               a  b
0  hello, "Bob", nice to see you  5